code-review/NRB_3471_3546/База_Было/Catalogs/ИсточникиКотировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсточникиКотировок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнебиржеваяПлощадка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/ИсточникиКотировок/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу источников котировок по коду
//
// Параметры:
//  РодительПервогоУровня	 - СправочникСсылка.ИсточникиКотировок	 - Глобальная группа
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Кеш (таблица ссылок на источники котировок)
//
Функция ПолучитьКеш(РодительПервогоУровня) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсточникиКотировок.Код КАК Код,
	|	&РодительПервогоУровня КАК РодительПервогоУровня,
	|	ИсточникиКотировок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсточникиКотировок КАК ИсточникиКотировок
	|ГДЕ
	|	ИсточникиКотировок.Ссылка В ИЕРАРХИИ(&РодительПервогоУровня)
	|	И НЕ ИсточникиКотировок.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РодительПервогоУровня", РодительПервогоУровня);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает источник котировок по коду
//
// Параметры:
//  Код						 - Строка							 - Код источника в глобальной группе
//  РодительПервогоУровня	 - СправочникСсылка.ИсточникиКотировок	 - Глобальная группа (RuData и т.п.)
//  Кеш						 - ТаблицаЗначений						 - Кеш (справочник источников котировок в виде таблицы)
// 
// Возвращаемое значение:
//   - СправочникСсылка.ИсточникиКотировок - Ссылка на найденый источник котировок
//
Функция Получить(Код, РодительПервогоУровня, Кеш = Неопределено) Экспорт
	
	КодСтрокой = КодИсточникаСтрокой(Код);
	
	Если Кеш = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсточникиКотировок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИсточникиКотировок КАК ИсточникиКотировок
		|ГДЕ
		|	ИсточникиКотировок.Код = &Код
		|	И ИсточникиКотировок.Ссылка В ИЕРАРХИИ(&РодительПервогоУровня)
		|	И НЕ ИсточникиКотировок.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Код", КодСтрокой);
		Запрос.УстановитьПараметр("РодительПервогоУровня", РодительПервогоУровня);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Справочники.ИсточникиКотировок.ПустаяСсылка();
		Иначе
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
	Иначе
		
		СтруктураПоиска = Новый Структура("Код, РодительПервогоУровня", КодСтрокой, РодительПервогоУровня);
		Источники = Кеш.НайтиСтроки(СтруктураПоиска);
		Если Источники.Количество() = 0 Тогда
			Возврат Справочники.ИсточникиКотировок.ПустаяСсылка();
		Иначе
			Возврат Источники[0].Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Функция - Создать
//
// Параметры:
//  Родитель				 - СправочникСсылка.ИсточникиКотировок	 - Группа источника котировки
//  ПараметрыСоздания		 - Структура							 - Структура параметров создания с полями "id", "shortname_rus", "fullname_rus"
//  Кеш						 - ТаблицаЗначений						 - Кеш (справочник источников котировок в виде таблицы)
//  РодительПервогоУровня	 - СправочникСсылка.ИсточникиКотировок	 - Глобальная группа (RuData и т.п.)
//  ВнебиржеваяПлощадка		 - Булево								 - Признак внебиржевой площадки
// 
// Возвращаемое значение:
//   - СправочникСсылка.ИсточникиКотировок - Ссылка на созданный источник котировок
//
Функция Создать(Родитель, ПараметрыСоздания, Кеш = Неопределено, РодительПервогоУровня = Неопределено, ВнебиржеваяПлощадка = Ложь) Экспорт
	
	ИсточникиКотировокОбъект = Справочники.ИсточникиКотировок.СоздатьЭлемент();
	
	ИсточникиКотировокОбъект.Родитель			 = Родитель;
	ИсточникиКотировокОбъект.Код				 = КодИсточникаСтрокой(ПараметрыСоздания.id);
	ИсточникиКотировокОбъект.Наименование		 = СокрЛП(ПараметрыСоздания.shortname_rus);
	ИсточникиКотировокОбъект.ПолноеНаименование	 = СокрЛП(ПараметрыСоздания.fullname_rus);
	ИсточникиКотировокОбъект.ВнебиржеваяПлощадка = ВнебиржеваяПлощадка;
	
	ИсточникиКотировокОбъект.ОбменДанными.Загрузка = Истина;
	ИсточникиКотировокОбъект.Записать();
	
	Если Не Кеш = Неопределено Тогда
		НовыйИсточникВКеш = Кеш.Добавить();
		НовыйИсточникВКеш.Код					 = КодИсточникаСтрокой(ИсточникиКотировокОбъект.Код);
		НовыйИсточникВКеш.РодительПервогоУровня	 = РодительПервогоУровня;
		НовыйИсточникВКеш.Ссылка				 = ИсточникиКотировокОбъект.Ссылка;
	КонецЕсли;
	
	Возврат  ИсточникиКотировокОбъект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодИсточникаСтрокой(КодИсточника)
	
	Если ТипЗнч(КодИсточника) = Тип("Число") Тогда
		КодИсточникаСтрокой = Формат(КодИсточника, "ЧГ=0");
	Иначе
		КодИсточникаСтрокой = СокрЛП(КодИсточника);
	КонецЕсли;
	
	Возврат КодИсточникаСтрокой;
	
КонецФункции

#КонецОбласти
